# ViewSolarstudyIsLightingStudyType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyIsLightingStudyType Property
ParameterTypeId Class See Also
---
"Lighting study"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyIsLightingStudyType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyIsLightingStudyType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyIsLightingStudyType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace